================================================================================
Latte in HTML attribute - single expression
================================================================================

<input value="{$foo}">

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (latte_variable
            (php_only)))))))

================================================================================
Latte in HTML attribute - mixed content
================================================================================

<div class="text-{$color}">
</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value)
          (latte_variable
            (php_only)))))
    (end_tag
      (tag_name))))

================================================================================
Latte in HTML attribute - multiple expressions
================================================================================

<div data-value="prefix-{$val1}-middle-{$val2}-suffix">
</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value)
          (latte_variable
            (php_only))
          (attribute_value)
          (latte_variable
            (php_only))
          (attribute_value))))
    (end_tag
      (tag_name))))

================================================================================
HTML inside Latte block
================================================================================

{if $foo}
  <span>Bar</span>
{/if}

--------------------------------------------------------------------------------

(document
  (if_block
    open: (directive_start)
    condition: (php_only)
    (element
      (start_tag
        (tag_name))
      (text)
      (end_tag
        (tag_name)))
    close: (directive_end)))

================================================================================
Foreach with variable in HTML
================================================================================

{foreach $items as $item}
  <li>{$item}</li>
{/foreach}

--------------------------------------------------------------------------------

(document
  (loop_block
    open: (directive_start)
    content: (php_only)
    (element
      (start_tag
        (tag_name))
      (latte_variable
        (php_only))
      (end_tag
        (tag_name)))
    close: (directive_end)))
