================================================================================
Simple variable
================================================================================

{$item}

--------------------------------------------------------------------------------

(document
  (latte_variable
    (variable_name)))

================================================================================
Variable in HTML
================================================================================

<li>{$item}</li>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name))
    (latte_variable
      (variable_name))
    (end_tag
      (tag_name))))

================================================================================
Multiple variables in HTML
================================================================================

<div>{$name} - {$email}</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name))
    (latte_variable
      (variable_name))
    (text)
    (latte_variable
      (variable_name))
    (end_tag
      (tag_name))))

================================================================================
Simple print tag
================================================================================

{=$variable}

--------------------------------------------------------------------------------

(document
  (latte_print_tag
    (filter_expression)))
